Revit 2026 API

# DockablePanesBuiltInDockablePanes Class

---

A collection of ids of the dockable panes provided by Revit.

SystemObject Autodesk.Revit.UIDockablePanesBuiltInDockablePanes

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class BuiltInDockablePanes
```
```vb
Public NotInheritable Class BuiltInDockablePanes
```
```cpp
public ref class BuiltInDockablePanes abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BuiltInDockablePanes = class end
```

The DockablePanesBuiltInDockablePanes type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ContentDelivery | The content delivery pane. |
|  | ElementView | The element view pane. |
|  | FabricationPartBrowser | The Fabrication part browser pane. |
|  | HostByLinkNavigator | The host by link navigator pane. |
|  | PnIdModelerBrowser | The P&ID modeler browser pane. |
|  | ProjectBrowser | The project browser pane. |
|  | PropertiesPalette | The properties palette pane. |
|  | RebarBrowser | The rebar browser pane. |
|  | SharedViews | The shared view pane. |
|  | SystemNavigator | The system browser pane. |
|  | ViewBrowser | The View browser pane. |

#### Reference

Autodesk.Revit.UI Namespace